app/controllers/pictures_controller.rb

  def create
    @picture = Picture.new
    @picture.title = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url = params[:picture][:url]
    if @picture.save
---
INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "21 savage"], ["title", "ric flair drop"], ["url", "www.21savage.com"], ["created_at", 2018-01-09 22:19:42 UTC], ["updated_at", 2018-01-09 22:19:42 UTC]]

  def update
    @picture = Picture.find(params[:id])
    @picture.title = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url = params[:picture][:url]

  if @picture.save
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "pictures" SET "title" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["title", "Sea P"], ["updated_at", 2018-01-23 00:19:17 UTC], ["id", 2]]